Repository: maksroxx/warehousesys
Catalog: lib/l10n/app_*.arb
Languages: ru

source: Dashboard
ru: Обзор

source: Inventory
ru: Склад

source: Orders
ru: Заказы

source: Shipments
ru: Отгрузки

source: Reports
ru: Отчеты

source: Counterparties
ru: Контрагенты

source: Settings
ru: Настройки

source: Expand panel
ru: Развернуть панель

source: Collapse panel
ru: Свернуть панель

source: Search counterparties...
ru: Поиск контрагентов...

source: Add Counterparty
ru: Добавить контрагента

source: No counterparties found.
ru: Контрагенты не найдены.

source: Name
ru: Имя

source: Phone
ru: Телефон

source: Address
ru: Адрес

source: Edit Counterparty
ru: Редактировать

source: Delete Counterparty
ru: Удалить

source: Confirm deletion
ru: Подтвердите удаление

# deleteCounterpartyConfirmation
source: Are you sure you want to delete counterparty "{name}"? This action cannot be undone.
ru: Вы уверены, что хотите удалить контрагента "{name}"? Это действие нельзя будет отменить.

source: Cancel
ru: Отмена

source: Delete
ru: Удалить

# counterpartyDeleted
source: Counterparty successfully deleted
ru: Контрагент успешно удален

# deleteError
source: Deletion error: {error}
ru: Ошибка удаления: {error}

source: Create Income Document
ru: Создание прихода

source: Create Outcome Document
ru: Создание расхода

# loadingBaseDocument
source: Loading data from base document...
ru: Загрузка данных из документа-основания...

# basedOnDocument
source: Based on document #{number}
ru: На основании документа №{number}

# errorLoadingBaseDocument
source: Error loading base document: {error}
ru: Ошибка загрузки основания: {error}

# warehouseLabel
source: Warehouse
ru: Склад

# selectWarehouseError
source: Please select a warehouse
ru: Выберите склад

source: Error loading warehouses
ru: Ошибка загрузки складов

# counterpartyLabel
source: Counterparty
ru: Контрагент

# searchCounterpartyHint
source: Search for a counterparty...
ru: Поиск контрагента...

source: Select Counterparty
ru: Выбор контрагента

# selectCounterpartyError
source: Please select a counterparty
ru: Выберите контрагента

source: Error loading counterparties
ru: Ошибка загрузки контрагентов

# commentLabel
source: Comment
ru: Комментарий

# commentHint
source: Add a comment, e.g. supplier invoice number
ru: Добавьте комментарий (напр. номер накладной)

# tableItem
source: Item
ru: Товар

# tableSku
source: Sku
ru: Артикул

# tableQuantity
source: Quantity
ru: Кол-во

# tableUnit
source: Unit
ru: Ед.

# tablePrice
source: Price
ru: Цена

# tableSum
source: Sum
ru: Сумма

source: No items added
ru: Нет добавленных позиций

source: Select Items
ru: Выбрать товары

# itemsError
source: Please add at least one item
ru: Добавьте хотя бы одну позицию

# quantityError
source: Quantity must be greater than zero
ru: Количество должно быть больше нуля

# totalItems
source: Total items: {count}
ru: Позиций: {count}

# totalSum
source: Total Sum: {sum}
ru: Сумма: {sum}

source: Save
ru: Сохранить

# postAndClose
source: Post & Close
ru: Провести и закрыть

# documentSavedDraft
source: Document saved successfully as a draft!
ru: Документ сохранен как черновик!

# documentPostedSuccess
source: Document posted successfully!
ru: Документ успешно проведен!

# saveError
source: Error saving document: {error}
ru: Ошибка сохранения: {error}

# postError
source: Error posting document: {error}
ru: Ошибка проведения: {error}

source: Income Document
ru: Приход

source: Outcome Document
ru: Расход

# statusDraft
source: Draft
ru: Черновик

# statusPosted
source: Posted
ru: Проведен

# deleteDocumentTooltip
source: Delete Document
ru: Удалить документ

# confirmDocumentDeletionContent
source: Are you sure you want to delete document #{number}? This action cannot be undone.
ru: Вы уверены, что хотите удалить документ №{number}? Это действие нельзя отменить.

# draftUpdatedSuccess
source: Draft updated successfully!
ru: Черновик успешно обновлен!

# draftUpdateError
source: Error updating draft: {error}
ru: Ошибка обновления черновика: {error}

# documentLoadingError
source: Error loading document: {error}
ru: Ошибка загрузки документа: {error}

source: No items in document
ru: В документе нет товаров

source: Save Changes
ru: Сохранить изменения

source: Processing...
ru: Обработка...

source: Post Document
ru: Провести документ

source: Create Shipment
ru: Создать отгрузку

source: Close
ru: Закрыть

source: Inventory Management
ru: Управление запасами

source: Add Item
ru: Добавить товар

# searchItemsHint
source: Search for items
ru: Поиск товаров

# errorLoadingData
source: Error loading data: {error}
ru: Ошибка загрузки данных: {error}

source: No items found
ru: Товары не найдены

source: Loading...
ru: Загрузка...

source: Error
ru: Ошибка

source: All Categories
ru: Все категории

# categoryLabel
source: Category
ru: Категория

source: All Locations
ru: Все локации

# locationLabel
source: Location
ru: Локация

source: All Statuses
ru: Все статусы

source: In Stock
ru: В наличии

source: Out of Stock
ru: Нет в наличии

# tableItemName
source: Item Name
ru: Наименование

# tableCategory
source: Category
ru: Категория

# tableStatus
source: Status
ru: Статус

# tableActions
source: Actions
ru: Действия

source: View
ru: Просмотр

# confirmVariantDeletionContent
source: Are you sure you want to delete variant "{name}" (SKU: {sku})? This action cannot be undone.
ru: Вы уверены, что хотите удалить вариант "{name}" (SKU: {sku})? Это действие нельзя отменить.

# itemDeletedSuccess
source: Item successfully deleted
ru: Товар успешно удален

source: Back to Inventory
ru: Назад к списку

source: Edit Item
ru: Редактировать товар

source: Delete Item
ru: Удалить товар

source: Detailed Information
ru: Детальная информация

source: Description
ru: Описание

source: Attributes
ru: Атрибуты

source: Category
ru: Категория

source: Unit
ru: Ед. измерения

source: Characteristics
ru: Характеристики

source: Real-time Data
ru: Данные в реальном времени

source: Stock Levels
ru: Уровень запасов

# movementHistory
source: Movement History (Last 10)
ru: История движений (последние 10)

# errorLoadingDescription
source: Error loading description: {error}
ru: Ошибка загрузки описания: {error}

source: No movements found.
ru: Движений не найдено.

# tableWarehouse
source: Warehouse
ru: Склад

# tableOnHand
source: On Hand
ru: В наличии

# tableReserved
source: Reserved
ru: Резерв

# tableAvailable
source: Available
ru: Доступно

source: Total
ru: Итого

# tableDate
source: Date
ru: Дата

# tableType
source: Type
ru: Тип

# tableDocument
source: Document
ru: Документ

# searchOrdersHint
source: Search orders...
ru: Поиск заказов...

source: Create Order
ru: Создать заказ

source: No orders found.
ru: Заказы не найдены.

# cardCounterparty
source: Counterparty: {name}
ru: Контрагент: {name}

# cardCreated
source: Created: {date}
ru: Создано: {date}

# cardItems
source: Items: {count}
ru: Позиций: {count}

# viewDetails
source: View Details â†’
ru: Подробнее →

# statusCanceled
source: Canceled
ru: Отменен

# searchShipmentsHint
source: Search shipments...
ru: Поиск документов...

source: No shipments found.
ru: Документы не найдены.

source: Create Document
ru: Создать документ

source: Choose document type
ru: Выберите тип документа

source: Income
ru: Приход

source: Outcome
ru: Расход

# editItemDialogTitle
source: Edit Item
ru: Редактировать товар

# addNewItemDialogTitle
source: Add New Item
ru: Добавить новый товар

# enterProductNameError
source: Enter new product name or select existing one
ru: Введите название нового продукта или выберите существующий

# selectCategoryError
source: Category is required for new product
ru: Для нового продукта необходимо выбрать категорию

# itemUpdatedSuccess
source: Item successfully updated!
ru: Товар успешно обновлен!

# itemAddedSuccess
source: Item successfully added!
ru: Товар успешно добавлен!

# unknownError
source: Unknown error occurred
ru: Произошла неизвестная ошибка

# skuExistsError
source: This SKU already exists. Please enter a unique one.
ru: Этот Артикул (SKU) уже существует. Пожалуйста, введите уникальный.

# serverError
source: Internal server error.
ru: Внутренняя ошибка сервера.

# networkError
source: Network error: {message}
ru: Ошибка сети: {message}

# generalError
source: Error: {message}
ru: Ошибка: {message}

# categoryCreateError
source: Error creating category: {error}
ru: Ошибка создания категории: {error}

# orSeparator
source: Or
ru: Или

# productSection
source: Product
ru: Продукт

# selectExistingProduct
source: Select Existing Product (optional)
ru: Выбрать существующий (опционально)

# selectProductHint
source: Select a product...
ru: Выберите продукт...

# createNewProductSection
source: Create New Product
ru: Создать новый продукт

source: New Product Name
ru: Название нового продукта

# productNameHint
source: e.g., Super Widget
ru: напр., Супер Виджет

# newCategoryNameHint
source: New category name
ru: Название новой категории

# selectCategoryHint
source: Select a category
ru: Выберите категорию

# addNewOption
source: Add New...
ru: Добавить новую...

# descriptionHint
source: Describe the product
ru: Опишите продукт

# variationSection
source: Variation
ru: Вариант

# variationDetailsSection
source: Variation Details
ru: Детали варианта

# skuHint
source: e.g., SW-BLUE-LG-01
ru: напр., SW-BLUE-LG-01

# requiredField
source: Required
ru: Обязательно

# characteristicsSection
source: Characteristics
ru: Характеристики

# noCharacteristicsYet
source: This item has no set characteristics yet.
ru: У этого товара еще нет заданных характеристик.

# valueFor
source: Value for {type}
ru: Значение для {type}

source: Add New Characteristic
ru: Добавить характеристику

# productDetailsSection
source: Product Details
ru: Детали продукта

# propertyLabel
source: Property
ru: Свойство

# valueLabel
source: Value
ru: Значение

source: Select Items from Stock
ru: Выберите товары со склада

# searchItemsByNameSku
source: Search for items by name or SKU...
ru: Поиск по названию или артикулу...

source: Add Selected
ru: Добавить выбранные

# tableInStock
source: In Stock
ru: В наличии

# editCounterpartyTitle
source: Edit Counterparty
ru: Редактировать контрагента

# newCounterpartyTitle
source: New Counterparty
ru: Новый контрагент

# nameLabel
source: Name
ru: Наименование

# nameHint
source: e.g. Acme Corp or John Doe
ru: ООО "Ромашка" или Иван Иванов

# phoneLabel
source: Phone
ru: Телефон

# addressLabel
source: Address
ru: Адрес

# addressHint
source: City, street, building
ru: Город, улица, дом

# counterpartyUpdatedSuccess
source: Counterparty updated successfully!
ru: Контрагент успешно обновлен!

# counterpartyCreatedSuccess
source: Counterparty created successfully!
ru: Контрагент успешно создан!

source: Income Note
ru: Приходная накладная

source: Outcome Note
ru: Расходная накладная

# documentErrorLoading
source: Error loading document: {error}
ru: Ошибка загрузки документа: {error}

source: Basic Information
ru: Основная информация

source: Document Content
ru: Содержимое документа

source: Go to Document
ru: Перейти к документу

# dateLabel
source: Date:
ru: Дата:

# statusLabel
source: Status:
ru: Статус:

# warehouseLabelColon
source: Warehouse:
ru: Склад:

# counterpartyLabelColon
source: Counterparty:
ru: Контрагент:

# commentLabelColon
source: Comment:
ru: Комментарий:

# tableItemSku
source: ITEM (SKU)
ru: ТОВАР (SKU)

# tableQtyShort
source: QTY
ru: КОЛ-ВО

# overviewSubtitle
source: Overview of your warehouse operations
ru: Обзор операций вашего склада

source: Total Stock
ru: Всего товаров

# totalStockValue
source: 12,500 items
ru: 12,500 шт.

source: Recent Operations
ru: Недавние операции

# recentOperationsValue
source: 320 operations
ru: 320 операций

source: Expected Deliveries
ru: Ожидаемые поставки

# expectedDeliveriesValue
source: 50 deliveries
ru: 50 поставок

source: Last 30 Days
ru: За 30 дней

source: Recent Activity
ru: Недавняя активность

source: Last 7 Days
ru: За 7 дней

source: Mon
ru: Пн

source: Tue
ru: Вт

source: Wed
ru: Ср

source: Thu
ru: Чт

source: Fri
ru: Пт

source: Sat
ru: Сб

source: Sun
ru: Вс

# reportsPageTitle
source: Reports
ru: Отчеты

# reportsPageSubtitle
source: Generate and view various reports related to warehouse operations.
ru: Генерация и просмотр отчетов по складским операциям.

source: Report Selection
ru: Выбор отчета

# stockLevelsReport
source: Stock Levels
ru: Уровни запасов

# stockLevelsDesc
source: Current stock levels for all items
ru: Текущие остатки по всем товарам

# movementHistoryReport
source: Movement History
ru: История движений

# movementHistoryDesc
source: History of item movements in and out
ru: История приходов и расходов товаров

# supplierPerformanceReport
source: Supplier Performance
ru: Эффективность поставщиков

# supplierPerformanceDesc
source: Performance metrics for each supplier
ru: Метрики производительности по поставщикам

# orderFulfillmentReport
source: Order Fulfillment
ru: Исполнение заказов

# orderFulfillmentDesc
source: Details on order fulfillment rates
ru: Детали по уровню выполнения заказов

# inventoryTurnoverReport
source: Inventory Turnover
ru: Обороты запасов

# inventoryTurnoverDesc
source: Rate at which inventory is sold
ru: Скорость продажи товарных запасов

source: Report Parameters
ru: Параметры отчета

source: Start Date
ru: Дата начала

source: End Date
ru: Дата окончания

# itemFilter
source: Item Filter (Optional)
ru: Фильтр по товару (необязательно)

# itemFilterHint
source: Enter item name or SKU
ru: Введите название или артикул

source: Generate Report
ru: Сформировать отчет
